In [1]:
import pandas as pd
import numpy as np

In [2]:
series = pd.Series([5, 10, np.nan, 20, 15])

In [3]:
series.sum()

50.0

In [4]:
series.mean()

12.5

In [5]:
series.min()

5.0

In [6]:
series.max()

20.0

In [7]:
series.isnull()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [8]:
series.notnull()

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [9]:
df = pd.DataFrame({'A': [1, np.nan, 3, 4], 'B': [np.nan, 2, 3, 4]})

In [10]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [11]:
df['C'] = [np.nan, 5, np.nan, 7]

In [12]:
df.ffill(axis=0)

     A    B    C
0  1.0  NaN  NaN
1  1.0  2.0  5.0
2  3.0  3.0  5.0
3  4.0  4.0  7.0

In [13]:
df.bfill(axis=1)

     A    B    C
0  1.0  NaN  NaN
1  2.0  2.0  5.0
2  3.0  3.0  NaN
3  4.0  4.0  7.0

In [7]:
val=np.array([1,np.nan,3])

In [8]:
np.nansum(val)

4.0

In [10]:
type(val)

numpy.ndarray

In [1]:
import pandas as pd

# Sample data
data = {
    'Region': ['North', 'South', 'North', 'East', 'West', 'East', 'South', 'West', 'North', 'East'],
    'Salesperson': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack'],
    'Product': ['A', 'B', 'A', 'C', 'B', 'A', 'C', 'C', 'B', 'A'],
    'Sales': [200, 120, 340, 560, 220, 300, 150, 500, 250, 100]
}

df = pd.DataFrame(data)
print(df)

  Region Salesperson Product  Sales
0  North       Alice       A    200
1  South         Bob       B    120
2  North     Charlie       A    340
3   East       David       C    560
4   West         Eve       B    220
5   East       Frank       A    300
6  South       Grace       C    150
7   West      Hannah       C    500
8  North         Ian       B    250
9   East        Jack       A    100

In [2]:
# Aggregating by 'Region' and 'Product'
region_product_agg = df.groupby(['Region', 'Product'])['Sales'].agg(['sum', 'mean']).reset_index()
print(region_product_agg)

  Region Product  sum   mean
0   East       A  400  200.0
1   East       C  560  560.0
2  North       A  540  270.0
3  North       B  250  250.0
4  South       B  120  120.0
5  South       C  150  150.0
6   West       B  220  220.0
7   West       C  500  500.0

In [3]:

# Define a custom function for classification
def sales_classification(sales):
    return 'High' if sales > 300 else 'Low'

# Apply function to each 'Sales' value
df['Sales_Class'] = df['Sales'].apply(sales_classification)
print(df)

  Region Salesperson Product  Sales Sales_Class
0  North       Alice       A    200         Low
1  South         Bob       B    120         Low
2  North     Charlie       A    340        High
3   East       David       C    560        High
4   West         Eve       B    220         Low
5   East       Frank       A    300         Low
6  South       Grace       C    150         Low
7   West      Hannah       C    500        High
8  North         Ian       B    250         Low
9   East        Jack       A    100         Low